init.el
;; -*- lexical-binding: t; -*-
(message "Start reading ~/.emacs.d/init.el ...")

;; ==============================================================
;; CUSTOM FUNCTIONS
;; ==============================================================

(defun my/scroll-half-page-down ()
  "scroll down half the page"
  (interactive)
  (scroll-down (/ (window-body-height) 2)))


(defun my/scroll-half-page-up ()
  "scroll up half the page"
  (interactive)
  (scroll-up (/ (window-body-height) 2)))


(defun my/duplicate-current-line-or-region (arg)
  "Duplicates the current line or region ARG times.
      If there's no region, the current line will be duplicated. However, if
      there's a region, all lines that region covers will be duplicated."
  (interactive "p")
  (let (beg end (origin (point)))
    (if (and mark-active (> (point) (mark)))
        (exchange-point-and-mark))
    (setq beg (line-beginning-position))
    (if mark-active
        (exchange-point-and-mark))
    (setq end (line-end-position))
    (let ((region (buffer-substring-no-properties beg end)))
      (dotimes (i arg)
        (goto-char end)
        (newline)
        (insert region)
        (setq end) (point))
      (goto-char (+ origin (* (length region) arg) arg)))))


(defun my/toggle-highlight-trailing-whitespaces ()
  "Function toggles highlighting trailing whitespaces"
  (interactive)
  (if (bound-and-true-p show-trailing-whitespace)
      (progn  (message "Disable highlighting of trailing whitespaces")
              (setq-default show-trailing-whitespace nil))
    (progn (message "Enable highlighting of trailing whitespaces")
           (setq-default show-trailing-whitespace t))))



(defun my/toggle-idle-highlight-mode ()
  "Function toggles 'idle-highlight-mode'"
  (interactive)
  (if (bound-and-true-p dle-highlight-mode)
      (progn  (message "Disable 'idle-highlight-mode'")
              (setq-default idle-highlight-mode nil))
    (progn (message "Enable 'idle-highlight-mode'")
           (setq-default idle-highlight-mode t))))


(defun my/which-active-modes ()
  "Give a message of which minor modes are enabled in the current buffer."
  (interactive)
  (let ((active-modes))
    (mapc (lambda (mode) (condition-case nil
                             (if (and (symbolp mode) (symbol-value mode))
                                 (add-to-list 'active-modes mode))
                           (error nil) ))
          minor-mode-list)
    (message "Active modes are %s" active-modes)))


(defun my/term ()
  "My custom term command."
  (interactive)
  (set-buffer (make-term "terminal" explicit-shell-file-name))
  (term-mode)
  (term-char-mode)
  (switch-to-buffer "*terminal*"))


(defun my/untabify-entire-buffer ()
  (interactive)
  (mark-whole-buffer)
  (untabify (region-beginning) (region-end))
  (message "Converting all TAB's to spaces")
  (keyboard-quit))


(defun my/open-init-file ()
  (interactive)
  (find-file "~/.emacs.d/init.el")
  (message "Init file opened"))


;; Function copied from Emacs Wiki (https://www.emacswiki.org/emacs/KillingBuffers)
(defun my/close-and-kill-this-pane ()
  "If there are multiple windows, then close this pane and kill the buffer in it also."
  (interactive)
  (kill-this-buffer)
  (if (not (one-window-p))
      (delete-window)))


;; Function copied from Emacs Wiki (https://www.emacswiki.org/emacs/KillingBuffers)
(defun my/close-and-kill-next-pane ()
  "If there are multiple windows, then close the other pane and kill the buffer in it also."
  (interactive)
  (other-window 1)
  (kill-this-buffer)
  (if (not (one-window-p))
      (delete-window)))


(defun my/other-window-kill-buffer ()
  "Function woks when there are multiple windows opened in the current frame.
   Kills the currently opened buffer in all the other windows"
  (interactive)
  ;; Window selection is used because point goes to a different window
  ;; if more than 2 windows are present
  (let ((win-curr (selected-window))
        (win-other (next-window)))
    (select-window win-other)
    (kill-this-buffer)
    (select-window win-curr)))


(defun my/kill-other-buffers ()
  "Kill all other buffers except the active buffer."
  (interactive)
  (mapc 'kill-buffer
        (delq (current-buffer) (buffer-list))))


;; TODO: prevent function from removing *Messages buffer
;; https://stackoverflow.com/questions/1687620/regex-match-everything-but-specific-pattern
(defun my/kill-asterisk-buffers ()
  "Kill all buffers whose names start with an asterisk (‘*’).
   By convention, those buffers are not associated with files."
  (interactive)
  (kill-matching-buffers "*" nil t)
  (message "All asterisk (*) buffers have been killed"))


(defun my/reinstall-all-activated-packages ()
  "Refresh and reinstall all activated packages."
  (interactive)
  (package-refresh-contents)
  (dolist (package-name package-activated-list)
    (when (package-installed-p package-name)
      (unless (ignore-errors                   ;some packages may fail to install
                (package-reinstall package-name))
        (warn "Package %s failed to reinstall" package-name)))))

(defun my/reinstall-package (pkg)
  (interactive (list (intern (completing-read "Reinstall package: " (mapcar #'car package-alist)))))
  (unload-feature pkg)
  (package-reinstall pkg)
  (require pkg))

;; ==============================================================
;; BASIC UI CONFIG
;; ==============================================================

;; Set startup screen photo
;; (setq fancy-splash-image "path")

(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
(tooltip-mode -1)
(set-fringe-mode 10)
(blink-cursor-mode 1)
(delete-selection-mode 1)
(column-number-mode 1)

;; Enable / disable displaying LR/CR characters
;; (global-whitespace-mode nil)

;; Enable mouse support in terminal Emacs
(xterm-mouse-mode 1)

;; Enable auto revert mode globally, so that all buffers will be in sync with whats actually on disk.
;; If you are sure that the file will only change by growing at the end, use Auto Revert Tail mode instead, as
;; it is more efficient for this.
(global-auto-revert-mode t)


;; How to get colors in temrinal Emacs ?
;; https://www.gnu.org/software/emacs/manual/html_mono/efaq.html#Colors-on-a-TTY

;; Mouse behaviour
(setq mouse-wheel-progressive-speed nil)

;; Enable full screen
(add-to-list 'default-frame-alist '(fullscreen . maximized))

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(global-hl-line-mode 1)
(set-face-background hl-line-face "gray13")

(setq-default show-trailing-whitespace 1)
(setq-default explicit-shell-file-name "/bin/bash")

;; ==============================================================
