init.el
;; ADDITIONAL CONFIG FILES
;; ==============================================================

;; Do not use `init.el` for `custom-*` code (generated by 'M-x customize' menu) - use `custom-file.el`.
(setq custom-file "~/.emacs.d/custom-file.el")

;; Use default Emacs bookmarks localisation (for now)
(setq bookmark-default-file "~/.emacs.d/bookmarks")

;; Assuming that the code in custom-file is execute before the code
;; ahead of this line is not a safe assumption. So load this file
;; proactively.
(load-file custom-file)

(setq url-proxy-services nil)

;; ==============================================================
;; PACKAGE REPOSITORIES
;; ==============================================================

(require 'package)

(add-to-list 'package-archives '("gnu"          . "https://elpa.gnu.org/packages/")     t)
(add-to-list 'package-archives '("melpa"        . "https://melpa.org/packages/")        t)
(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)

;; Load Emacs Lisp packages, and activate them - variable ‘package-load-list’ controls which packages to load.
(package-initialize)

;; Update list of available packages - sth like 'git fetch'
;; doing it together with 'unless' reduces emacs startup time significantly
(unless package-archive-contents
  (package-refresh-contents))

(when (not (package-installed-p 'use-package))
        (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

(use-package spacemacs-theme
  :ensure t
  :defer t
  :custom
        (setq spacemacs-theme-comment-bg nil)
        (setq spacemacs-theme-comment-italic t)
  :init (load-theme 'spacemacs-dark t))

(use-package dashboard
  :ensure t
  :diminish dashboard-mode
  :config
  (setq dashboard-banner-logo-title "Let's code ;)")
  (setq dashboard-startup-banner "~/.emacs.d/img/pm_profile_scaled.png")
  (setq dashboard-center-content t)
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-set-footer nil)
  (setq dashboard-items '((projects  . 5)
                          (bookmarks . 5)
			  (agenda    . 5)))
  (dashboard-setup-startup-hook))

;; ==============================================================
;; PACKAGES
;; ==============================================================

(defun my/org-mode-setup ()
  (interactive)
  (org-indent-mode)
  (variable-pitch-mode 1) ;; < what is that ?
  ;; Enable text wrapping in org-mode (it looks better when side piddings enbaled)
  (visual-line-mode 1))

(defun my/org-font-setup ()
  (interactive)
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•")))))))


(defun my/org-mode-visual-fill ()
  "Function imposes left and right side paddings in org-mode"
  (interactive)
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package org
  :ensure t
  :config
  (setq org-ellipsis " ▾")
  ;; start org-agenda in log-mode by default (like if 'a' option was chosen)
  (setq org-agenda-start-with-log-mode t)
  ;; whenever task is DONE - add information (log) about when the tash has been finished
  (setq org-log-done 'time)
  ;; Hide org emphasis characters, like *, =, -, + etc.
  (setq org-hide-emphasis-markers t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  (my/org-font-setup))

;; Package that allows left/right side padding in org mode
(use-package visual-fill-column
  :defer t)

(add-hook 'org-mode-hook #'my/org-mode-setup)
(add-hook 'org-mode-hook #'my/org-mode-visual-fill)

(dolist (face '((org-level-1 . 1.2)
                (org-level-2 . 1.1)
                (org-level-3 . 1.05)
                (org-level-4 . 1.0)
                (org-level-5 . 1.1)
                (org-level-6 . 1.1)
                (org-level-7 . 1.1)
                (org-level-8 . 1.1))))

;; Ensure that anything that should be fixed-pitch in Org files appears that way
(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
(set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-table nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

(set-face-attribute 'default nil :height 120)

;; Bind certain org emphasis functionalities to certain keys
(setq org-emphasis-alist
      (quote (("*" bold)
              ("/" italic)
              ("_" underline)
              ("=" (:foreground "orange" :background inherit))
              ("~" org-verbatim verbatim)
              ("+"
               (:strike-through t))
              )))

(use-package org-bullets
  :ensure t
  :after org
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(add-hook 'org-mode-hook #'org-bullets-mode)

;; This package enables org notifications on your OS desktop
(use-package org-wild-notifier
  :ensure t)
