init.el

(use-package org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/org_roam_database")
  (org-roam-completion-everywhere t)
  (org-roam-capture-templates
   '(("d" "default" plain
      "%?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)
     ("m" "meeting" plain
      (file "~/org_roam_database/templates/meeting_template.org")
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "")
      :unnarrowed t)
     ("e" "words" plain
      (file "~/org_roam_database/templates/words_template.org")
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "")
      :unnarrowed t)
     ("t" "todo list" plain
      (file "~/org_roam_database/templates/todos_template.org")
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "")
      :unnarrowed t)
     ("p" "private agenda" plain
      (file "~/org_roam_database/templates/private_agenda_template.org")
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "")
      :unnarrowed t)
     ("w" "work agenda" plain
      (file "~/org_roam_database/templates/work_agenda_template.org")
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "")
      :unnarrowed t)
     ))
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert)
         :map org-mode-map
         ("C-M-i" . completion-at-point)
         :map org-roam-dailies-map
         ("Y" . org-roam-dailies-capture-yesterday)
         ("T" . org-roam-dailies-capture-tomorrow)
         ("I" . my/org-roam-node-insert-immediate))
  :bind-keymap
  ("C-c n d" . org-roam-dailies-map)
  :config
  (require 'org-roam-dailies) ;; Ensure the keymap "org-roam-dailies-map" is available
  (org-roam-db-autosync-mode))

(defun my/org-roam-node-insert-immediate (arg &rest args)
  "Function allows to onsert/link a new note without the necessity of filling this note at the moment,
   so you can go back later and fill those notes in with more details"
  (interactive "P")
  (let ((args (cons arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))

(defun my/org-roam-filter-by-tag (tag-name)
  "Function filters Org Roam files by given tag.
   Tags are specified in Org Roam files in '#+filetags:' section."
  (lambda (node)
    (member tag-name (org-roam-node-tags node))))

(defun my/org-roam-list-notes-by-tag (tag-name)
  "Function returns list composed of all Org Roam files, containing given tag"
  (interactive)
  (mapcar #'org-roam-node-file
          (seq-filter
           (my/org-roam-filter-by-tag tag-name)
           (org-roam-node-list))))

(defun my/org-roam-refresh-agenda-list ()
  (interactive)
  (require 'org-roam)
  (setq org-agenda-files (append (my/org-roam-list-notes-by-tag "todos")
                                 (my/org-roam-list-notes-by-tag "work_agenda")
                                 (my/org-roam-list-notes-by-tag "private_agenda"))))

;; Build the agenda list the first time for the session
(my/org-roam-refresh-agenda-list)

;; Do not ask for permission to execute code block
(setq org-confirm-babel-evalauate nil)

;; Set (overwrite) default ORG Babel Header Arguments, for all code blocks.
;; See: https://orgmode.org/manual/Using-Header-Arguments.html
(setq org-babel-default-header-args
      (cons '(:tangle . "yes")
            (assq-delete-all :noweb org-babel-default-header-args)))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)
   (octave . t)
   (emacs-lisp . t)))

;; Set Babel to use Python 3
(setq org-babel-python-command "python3")

;; Enable unix-like configuration language (used in plenty of Unix configuration files)
(push '("conf-unix" . conf-unix) org-src-lang-modes)

;; This is needed as of Org 9.2
(require 'org-tempo)

;; Type for example
;;   - <py followed by TAB to insert python clode block
;;   - <el followed by TAB to insert elisp  clode block
(add-to-list 'org-structure-template-alist '("sh"  . "src shell"))
(add-to-list 'org-structure-template-alist '("el"  . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py"  . "src python"))
(add-to-list 'org-structure-template-alist '("sv"  . "src verilog"))
(add-to-list 'org-structure-template-alist '("vhd" . "src vhdl"))

;; Automatically tangle our Emacs.org config file when we save it
(defun my/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.emacs.d/Emacs.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda ()
                           (add-hook 'after-save-hook #'my/org-babel-tangle-config)))

(defun my/lsp-mode-setup ()
  "Function configures LSP by disabling/enabling particular LSP features
     See:
        https://emacs-lsp.github.io/lsp-mode/tutorials/how-to-turn-off/"
  ;; Configure headerline
  (setq lsp-headerline-breadcrumb-segments '(file symbols))
  (lsp-headerline-breadcrumb-mode)
  ;; Disable linter by default, as it is annoying (Flycheck / Flymake)
  (setq lsp-diagnostics-provider :none)
  ;; Configure LSP modeline features
  (setq lsp-modeline-code-actions-mode-segments '(count icon name))
  (lsp-modeline-code-actions-mode))


;; Language Server Protocol support
(use-package lsp-mode
  :ensure t
  :after (which-key)
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . my/lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
  :custom
  (lsp-clients-svlangserver-launchConfiguration "verilator -sv --lint-only -Wall")
  (lsp-clients-svlangserver-formatCommand "verible-verilog-format")
  :config
  (lsp-enable-which-key-integration t))

;; This package is reposnsible for displaying auxiliary informations on symbols
(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))


;; Great source of information about flyckeck:
;; https://www.masteringemacs.org/article/spotlight-flycheck-a-flymake-replacement
(use-package flycheck
  :ensure t
  :custom
  (global-flycheck-mode nil))


(use-package lsp-treemacs
  :after (lsp treemacs))


(use-package helm-lsp
  :after (lsp helm))

;; (define-key lsp-mode-map [remap xref-find-apropos] #'helm-lsp-workspace-symbol)

(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind
  (:map company-active-map
        ("<tab>" . company-complete-selection))
  (:map lsp-mode-map
        ("<tab>" . company-indent-or-complete-common))
  :custom
  ;; amount of letters need to be already typed in order to start completion
  (company-minimum-prefix-length 1)
  ;; time delya before starting completion
  (company-idle-delay 0.0))


(use-package company-box
  :hook (company-mode . company-box-mode))
