init.org
** projectile, treemacs-projectile

#+begin_src emacs-lisp
  (use-package projectile
    :ensure t
    :bind (
           ("<f7>"  . projectile-add-known-project)
           )
    :init
    (projectile-mode 1))
#+end_src

** treemacs

#+begin_src emacs-lisp
  (use-package treemacs
    :ensure t
    :bind (
           ("<C-f5>" . treemacs)
           ("<C-f6>" . treemacs-add-project-to-workspace)
           )
    :config
    (treemacs-follow-mode t)
    (treemacs-git-mode 'deferred)
    ;; Make tremacs display nice indents in files hierarchy
    ;; (treemacs-indent-guide-mode 't)
    ;; (treemacs-indent-guide-style 'line)
    :custom
    ;; This fixes problem with helm buffers (e.g. helm-M-x)
    ;; ocupying the entire widow
    (treemacs-display-in-side-window nil)
    ;; Set default treemacs width, and unlock the
    ;; drag-and-drop resize option
    (treemacs-width 50)
    (treemacs-width-is-initially-locked nil)
    ;; Disable test wrapping in treemacs window, when widnow is to narrow
    (treemacs-wrap-around nil)
    )

  (use-package treemacs-projectile
    :after (treemacs projectile)
    :ensure t)

  (use-package treemacs-icons-dired
    :after (treemacs dired)
    :ensure t
    :config (treemacs-icons-dired-mode 1))

  (use-package treemacs-magit
    :after (treemacs magit)
    :ensure t)

  (use-package treemacs-all-the-icons
    :ensure t
    :after (treemacs all-the-icons))
#+end_src

** helm

#+begin_src emacs-lisp
  (use-package helm
    :ensure t
    :bind  (("M-x"     . helm-M-x)
            ("M-y"     . helm-show-kill-ring)
            ("C-x C-f" . helm-find-files)
            ("C-b"     . helm-buffers-list)
            ("C-c h o" . helm-occur)
            ("C-c h b" . helm-filtered-bookmarks)
            )
    :custom
    (helm-position 'bottom)
    ;; This fixes problem with helm buffers (e.g. helm-M-x)
    ;; ocupying the entire widow.
    ;; Although "helm-split-window-in-side-p" is deprecated
    ;; and superseeded "helm-split-window-inside-p", both
    ;; variables have to be set to t.
    (helm-split-window-in-side-p t)
    (helm-split-window-inside-p t)
    :init
    (helm-mode 1)
    (helm-autoresize-mode 1))

  (use-package helm-swoop
    :ensure t
    :bind
    (("M-s"     . helm-swoop))
    :custom
    ;; This decreases helm swoop speed but in favour of colorded results
    (helm-swoop-speed-or-color t)
    ;; This fixes problem with helm-swoop appearing in another window,
    ;; when using multiple windows in one frame (treemacs / minimap)
    (helm-swoop-split-with-multiple-windows t)
    )

  (use-package helm-xref
    :ensure t
    :after helm
    :commands helm-xref
    :config
    (setq xref-show-xrefs-function 'helm-xref-show-xrefs))

  (use-package helm-projectile
    :ensure t
    :after (helm projectile)
    :bind(
          ("C-p"   . helm-projectile-find-file)
          ("C-l"   . helm-projectile-recentf)
          ("<f8>"  . helm-projectile-switch-project)
          ))

  (use-package helm-ag
    :ensure t)
#+end_src

** minimap

#+begin_src emacs-lisp
  (use-package minimap
    :ensure t
    :custom
    (minimap-always-recenter nil)
    (minimap-hide-fringes t)
    (minimap-hide-scroll-bar nil)
    (minimap-highlight-line nil)
    (minimap-minimum-width 20)
    (minimap-recenter-type (quote relative))
    (minimap-recreate-window t)
    (minimap-update-delay 0)
    (minimap-width-fraction 0.06)
    (minimap-window-location (quote right))
    :custom-face
    (minimap-active-region-background ((((background dark)) (:background "#3c3c3c" :extend t)) (t (:background "#C847D8FEFFFF" :extend t))))
    (minimap-font-face ((t (:weight bold :height 15 :width normal :family "DejaVu Sans Mono"))))
    :config
    (minimap-mode -1))
#+end_src

** verilog-mode

#+begin_src emacs-lisp
  (use-package verilog-mode
    :ensure t
    :custom
    (verilog-align-ifelse t)
    (verilog-auto-delete-trailing-whitespace t)
    (verilog-auto-indent-on-newline t)
    (verilog-auto-newline nil)
    (verilog-highlight-grouping-keywords t)
    (verilog-highlight-modules t)
    (verilog-indent-level 2)
    (verilog-indent-level-behavioral 2)
    (verilog-indent-level-declaration 2)
    (verilog-indent-level-directive 0)
    (verilog-indent-level-module 2))
#+end_src

** python-mode

#+begin_src emacs-lisp
  (use-package python-mode
    :ensure t
    :hook
    (python-mode . lsp-deferred)
    (python-mode . (lambda ()
                     (setq indent-tabs-mode t)
                     (setq tab-width 4)
                     (setq python-indent-offset 4)))
    :custom
    (python-shell-interpreter "python3"))

  ;; (use-package pyvenv
  ;;   :config
  ;;   (pyvenv-mode 1))
#+end_src

** paredit

#+begin_src emacs-lisp
;; (use-package paredit
;;   :ensure t
;;   :init
;;   (add-hook 'clojure-mode-hook #'enable-paredit-mode)
;;   (add-hook 'cider-repl-mode-hook #'enable-paredit-mode)
;;   (add-hook 'emacs-lisp-mode-hook #'enable-paredit-mode)
;;   (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
;;   (add-hook 'ielm-mode-hook #'enable-paredit-mode)
;;   (add-hook 'lisp-mode-hook #'enable-paredit-mode)
;;   (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
;;   (add-hook 'scheme-mode-hook #'enable-paredit-mode)
;;   :config
;;   (show-paren-mode t)
;;   (paredit-mode t)
;;   :bind (("M-[" . paredit-wrap-square)
;;       ("M-{" . paredit-wrap-curly))
;;   :diminish nil)
#+end_src

* Key bingings

#+begin_src emacs-lisp
  ;; ==============================================================
  ;; KEY BINDINGS
  ;; ==============================================================
#+end_src

#+begin_src emacs-lisp
  (global-set-key (kbd "M-v")        #'my/scroll-half-page-down)
  (global-set-key (kbd "C-v")        #'my/scroll-half-page-up)

  (global-set-key (kbd "<f5>")       #'revert-buffer)
  (global-set-key (kbd "<f6>")       #'my/kill-asterisk-buffers)
  (global-set-key (kbd "<f9>")       #'minimap-mode)
  (global-set-key (kbd "<f12>")      #'xref-find-definitions)

  (global-set-key (kbd "<prior>")    #'drag-stuff-up)
  (global-set-key (kbd "<next>")     #'drag-stuff-down)

  (global-set-key (kbd "C-x 0")      #'kill-buffer-and-window)
  (global-set-key (kbd "C-c d")      #'my/duplicate-current-line-or-region)
  (global-set-key (kbd "C-c k")      #'kill-whole-line)
  (global-set-key (kbd "C-c x")      #'delete-trailing-whitespace)
  (global-set-key (kbd "C-c w")      #'my/toggle-highlight-trailing-whitespaces)
  (global-set-key (kbd "C-c h")      #'my/toggle-idle-highlight-mode)
  (global-set-key (kbd "C-c C-e")   #'eval-region)
  (global-set-key (kbd "C-c t")       #'my/untabify-entire-buffer)

  (global-set-key (kbd "C-c o i")    #'my/open-init-file)
  (global-set-key (kbd "C-c o a")   #'org-agenda-list)

  (global-set-key (kbd "C-c p r")     #'helm-projectile-recentf)
  (global-set-key (kbd "C-c p R")    #'projectile-replace)
  (global-set-key (kbd "C-c p x")    #'projectile-replace-regexp)
  (global-set-key (kbd "C-,")          #'helm-projectile-grep)
  (global-set-key (kbd "C-.")          #'helm-projectile-ag)

  (define-key helm-map (kbd "TAB")   #'helm-execute-persistent-action)
  (define-key helm-map (kbd "<tab>") #'helm-execute-persistent-action)
  (define-key helm-map (kbd "C-z")   #'helm-select-action)

  (global-set-key (kbd "C-,")        #'helm-projectile-grep)
  (global-set-key (kbd "C-.")        #'helm-projectile-ag)

  (define-key org-mode-map (kbd "C-x C-z")  #'outline-hide-entry)
  (define-key org-mode-map (kbd "C-x C-a")  #'outline-hide-body)
  (define-key org-mode-map (kbd "C-x C-n")  #'outline-next-heading)
  (define-key org-mode-map (kbd "C-x C-p")  #'outline-prev-heading)

  (define-key org-agenda-mode-map (kbd "m")  #'org-agenda-month-view)

  (eval-after-load 'verilog-mode
    '(define-key verilog-mode-map (kbd "C-{") 'verilog-beg-of-defun))

  (eval-after-load 'verilog-mode
    '(define-key verilog-mode-map (kbd "C-}") 'verilog-end-of-defun))
#+end_src
